; domain
(define (domain rover-domain)
		(:requirements :strips)
    (:predicates
        (can-move ?from-waypoint ?to-waypoint)
        (is-visible ?objective ?waypoint)
        (is-in ?sample ?waypoint)
        (been-at ?rover ?waypoint)
        (carry ?rover ?sample)
        (at ?rover ?waypoint)
        (is-dropping-dock ?waypoint)
        (taken-image ?objective)
        (stored-sample ?sample)
        (objective ?objective)
        (waypoint ?waypoint)
        (sample ?sample)
        (rover ?rover)
        (empty ?rover)
    )

    (:action move
        :parameters
            (?rover
             ?from-waypoint
             ?to-waypoint)

        :precondition
            (and
                (rover ?rover)
                (waypoint ?from-waypoint)
                (waypoint ?to-waypoint)
                (at ?rover ?from-waypoint)
                (can-move ?from-waypoint ?to-waypoint))

        :effect
            (and
                (at ?rover ?to-waypoint)
                (been-at ?rover ?to-waypoint)
                (not (at ?rover ?from-waypoint)))
    )

    (:action take-sample
        :parameters
            (?rover
             ?sample
             ?waypoint)

        :precondition
            (and
                (rover ?rover)
                (sample ?sample)
                (waypoint ?waypoint)
                (is-in ?sample ?waypoint)
                (at ?rover ?waypoint)
                (empty ?rover))

        :effect
            (and
                (not (is-in ?sample ?waypoint))
                (carry ?rover ?sample)
                (not (empty ?rover)))
    )

    (:action drop-sample
        :parameters
            (?rover
             ?sample
             ?waypoint)

        :precondition
            (and
                (rover ?rover)
                (sample ?sample)
                (waypoint ?waypoint)
                (is-dropping-dock ?waypoint)
                (at ?rover ?waypoint)
                (carry ?rover ?sample))

        :effect
            (and
                (is-in ?sample ?waypoint)
                (not (carry ?rover ?sample))
                (stored-sample ?sample)
                (empty ?rover))
    )

    (:action take-image
        :parameters
            (?rover
             ?objective
             ?waypoint)

        :precondition
            (and
                (rover ?rover)
                (objective ?objective)
                (waypoint ?waypoint)
                (at ?rover ?waypoint)
                (is-visible ?objective ?waypoint))

        :effect
            (taken-image ?objective)
    )
)

; problem
(define (problem rover-1)

    (:domain 
        rover-domain    
    )
    
    (:objects
        waypoint1 waypoint2 waypoint3 waypoint4
        
        sample1 sample2 sample3 
        
        objective1 objective2 
        
        rover1
    )
    
    (:init
        
        (waypoint waypoint1) (waypoint waypoint2) (waypoint waypoint3) (waypoint waypoint4) 
        
        (sample sample1) (sample sample2)  
        
        (objective objective1) (objective objective2) 
        
        (can-move waypoint1 waypoint3) 
        (can-move waypoint3 waypoint1) 
        (can-move waypoint2 waypoint3) 
        (can-move waypoint3 waypoint2) 
        (can-move waypoint2 waypoint1) 
        (can-move waypoint2 waypoint4) 
        (can-move waypoint4 waypoint2) 
        
        (is-visible objective1 waypoint4) 
        (is-visible objective2 waypoint3)
        
        
        (is-in sample1 waypoint4) (is-in sample2 waypoint3)   
        
        (is-dropping-dock waypoint1)
        
        (rover rover1)
        (empty rover1)
        (at rover1 waypoint2)
    )
    
    (:goal
        (and 
            (stored-sample sample1)
            (stored-sample sample2)
            
            (taken-image objective1)
            (taken-image objective2)   
            
            (at rover1 waypoint2))
    )
)

; plan
1. (move rover1 waypoint2 waypoint4)
   deleted: (at rover1 waypoint2)
   added: (at rover1 waypoint4) (been-at rover1 waypoint4)
   goals met: 0 of 5
2. (take-image rover1 objective1 waypoint4)
   added: (taken-image objective1)
   goals met: 1 of 5
3. (take-sample rover1 sample1 waypoint4)
   deleted: (is-in sample1 waypoint4) (empty rover1)
   added: (carry rover1 sample1)
   goals met: 1 of 5
4. (move rover1 waypoint4 waypoint2)
   deleted: (at rover1 waypoint4)
   added: (at rover1 waypoint2) (been-at rover1 waypoint2)
   goals met: 2 of 5
5. (move rover1 waypoint2 waypoint3)
   deleted: (at rover1 waypoint2)
   added: (at rover1 waypoint3) (been-at rover1 waypoint3)
   goals met: 1 of 5
6. (take-image rover1 objective2 waypoint3)
   added: (taken-image objective2)
   goals met: 2 of 5
7. (move rover1 waypoint3 waypoint1)
   deleted: (at rover1 waypoint3)
   added: (at rover1 waypoint1) (been-at rover1 waypoint1)
   goals met: 2 of 5
8. (drop-sample rover1 sample1 waypoint1)
   deleted: (carry rover1 sample1)
   added: (is-in sample1 waypoint1) (stored-sample sample1) (empty rover1)
   goals met: 3 of 5
9. (move rover1 waypoint1 waypoint3)
   deleted: (at rover1 waypoint1)
   added: (at rover1 waypoint3)
   goals met: 3 of 5
10. (take-sample rover1 sample2 waypoint3)
   deleted: (is-in sample2 waypoint3) (empty rover1)
   added: (carry rover1 sample2)
   goals met: 3 of 5
11. (move rover1 waypoint3 waypoint1)
   deleted: (at rover1 waypoint3)
   added: (at rover1 waypoint1)
   goals met: 3 of 5
12. (drop-sample rover1 sample2 waypoint1)
   deleted: (carry rover1 sample2)
   added: (is-in sample2 waypoint1) (stored-sample sample2) (empty rover1)
   goals met: 4 of 5
13. (take-sample rover1 sample1 waypoint1)
   deleted: (is-in sample1 waypoint1) (empty rover1)
   added: (carry rover1 sample1)
   goals met: 4 of 5
14. (move rover1 waypoint1 waypoint3)
   deleted: (at rover1 waypoint1)
   added: (at rover1 waypoint3)
   goals met: 4 of 5
15. (move rover1 waypoint3 waypoint2)
   deleted: (at rover1 waypoint3)
   added: (at rover1 waypoint2)
   goals met: 5 of 5
